Revit 2027 API
MEPSection.Flow Property
 The flow of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Flow { get; }
Public ReadOnly Property Flow As Double
	Get
public:
property double Flow {
	double get ();
}
member Flow : float with get
Property Value
Double
Remarks
 In one section, all section members have same flow. Default unit is Cubic feet per second. For Duct, unit type is UT_HVAC_Airflow. For Pipe, unit type is UT_Piping_Flow
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace